Revit 2027 API
MEPNetworkIterator.End Method
 Checks if the network iteration has completed.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool End()
Public Function End As Boolean
public:
bool End()
member End : unit -> bool
Return Value
Boolean
 True if all analytical segments and nodes have been visited, otherwise false.
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace